import React from 'react';

import styles from './content.module.css';

const ApartmentsContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Основное:</h2>
            <p>
                Внутри этого раздела выдается список всех номеров конкретного отеля. И тут вы можете редактировать
                основные данные, цены номера. Добавлять/изменять/удалять фотографии номера.
            </p>
            <p>
                Так же повторюсь перед тем как загрузить изображения нужно их конвертировать в формат WEBP
                и после этого ужать, и только после всех действий загружать фотографии номера. Как делать все
                манипуляции с изображениями смотрите Документация =&gt; Основные =&gt; Работа с изображениями.
            </p>

            <h2>Данные номера:</h2>
            <p>
                <strong>Название - </strong> название номера, должно быть уникальное, чтобы человек не запутался при
                выборе номера. А так же чтобы вам было проще в CRM, так же не стоит давать длинные названия.
            </p>
            <p>
                <strong>Кол. этажей в доме - </strong> это просто информативное поле.
            </p>
            <p>
                <strong>Этаж расположения - </strong> это просто информативное поле.
            </p>
            <p>
                <strong>Аренда целиком - </strong> показывает можно ли аредавать весь дом целиком, так же показывает
                есть ли у этого номера зависимости от других номеров. (не изменяемое поле).
            </p>
            <p>
                <strong>Мак. кол. чел. - </strong> это просто информативное поле и так же используется при фильтрации
                номеров и проверки на кол. проживающих.
            </p>
            <p>
                <strong>Кол. комнат - </strong> это просто информативное поле.
            </p>
            <p>
                <strong>Описание дома - </strong> должно быть описание дома в котором распологается номер,
                использовать можно только один абзац.
            </p>
            <p>
                <strong>Описание номера - </strong> вы можете использовать маркдаун или просто заполнять с пробелом
                строчки. В этом поле предпологается возможность отображения нескольких абзацев.
            </p>
            <p>
                <strong>Описание удобств - </strong> тут лучше копировать из номеров где уже выполнена разметка и
                повторить ее,максимум изменяя составляющие списков. Если идти не по шаблону нарушиться верстка.
            </p>
            <p>
                <strong>Обложка номера - </strong> это изображение сохраниться на сервере, будет отображаться в
                карточке номера. Так же повторюсь перед тем как загрузить изображения нужно их конвертировать в формат
                WEBP и после этого ужать, и только после всех действий загружать картинки для статьи. Как делать все
                махинации с изображениями смотрите Документация =&gt; Основные =&gt; Работа с изображениями.
            </p>

            <h2>Цены номера:</h2>
            <p>
                Предоставлена возможность указать ценник для каждого диапозона отдельно. Нельзя писать сумму через
                пробел,использовать символы или буквы. Используется для автоматического подсчета при бронировании.
            </p>


            <h2>Фотографии номера:</h2>
            <p>
                У каждого номера вы можете добавить любое кол. фотографий, но желательно мин. 4шт, максимально 20шт. Во
                первых не перегружать сервер, не перегружать страницу и загрузку страницы.
            </p>
            <p>
                <strong>Фотография - </strong> это изображение сохраниться на сервере, будет отображаться на
                странице конкретного номера в слайдаре. Так же повторюсь перед тем как загрузить изображения нужно их
                конвертировать в формат WEBP и после этого ужать, и только после всех действий загружать картинки для
                статьи. Как делать все махинации с изображениями смотрите Документация =&gt; Основные =&gt; Работа с
                изображениями.
            </p>
            <p>
                <strong>Приоритет - </strong> будет отображаться в порядке возрастания по приоритету.
            </p>
        </div>
    );
};

export default ApartmentsContent;