import React from 'react';

import styles from './content.module.css';

const ArticleContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Основное для создания/редактирования:</h2>
            <p>
                При создании статьи нужно изначально создать саму статью с обложкой, а после этого зайтти в эту статью в
                режим редактирования и добавить фотографии. Самый важный момент который нужно учесть это, что при
                создании статьи на сервере создается отдельная папка для этой статьи и туда загружаются изображения, по
                этому перед тем как загрузить изображения нужно их конвертировать в формат WEBP и после этого ужать, и
                только после всех действий загружать картинки для статьи. Как делать все махинации с изображениями
                смотрите Документация =&gt; Основные =&gt; Работа с изображениями.
            </p>
            <p>
                При удалении любой фотографии она автоматически удаляется с сервера. При удаление целой статьи удаляется
                не только статья, но и папка со всеми изображениями этой статьи.
            </p>

            <h2>Основные поля:</h2>
            <p>
                <strong>Заголовок статьи - </strong> нужно указывать не длинный и осмысленный, так как это будет
                отображаться не только на сайтах, но и пойдет в сео.
            </p>
            <p>
                <strong>Кратке описание - </strong> нужно уместить не большое описание на один абзац, можно просто
                вставить первый абазц статьи.
            </p>
            <p>
                <strong>Статья - </strong> тут вы указываете полноценную статью, используется тихнология маркдаун, мой
                совет в соседней вкладкеоткрыть страницу Документация =&gt; Основные =&gt; Шаблонизатор Markdown, в нем
                изначально написать статью, а после скопировать и вставить в это поле.
            </p>
            <p>
                <strong>Область - </strong> нужно выбрать ту область к которой будет ближе текущая статья, это нужно для
                приоритетного размещения. То есть размещать на каждом сайте в приоритете те статьи которые ближе и
                возможно выложить только те статьи которые ближе на страницу контактов в разде &quot;интересные места&quot;.
            </p>
            <p>
                <strong>Обложка статьи - </strong> это изображение сохраниться на сервере, будет использоваться на
                обложке карточки статьи на странице &quot;блог&quot; у каждого отеля и на странице статьи оно будет находиться в
                виде превью. Так же повторюсь перед тем как загрузить изображения нужно их конвертировать в формат WEBP
                и после этого ужать, и только после всех действий загружать картинки для статьи. Как делать все
                махинации с изображениями смотрите Документация =&gt; Основные =&gt; Работа с изображениями.
            </p>

            <h2>После создания статьи:</h2>
            <p>
                Нужно выбрать конкретную статью нажав кнопку &quot;Изменить&quot;, выбрать &quot;Изображения статьи&quot;. Тут вы можете
                добавлять/изменять/удалять изображения для статьи. Они будут размещены в конце статьи.
            </p>
            <p>
                <strong>Фотография - </strong> это изображение сохраниться на сервере, будет отображаться на
                странице конкретной статьи в самом низу. Так же повторюсь перед тем как загрузить изображения нужно их
                конвертировать в формат WEBP и после этого ужать, и только после всех действий загружать картинки для
                статьи. Как делать все махинации с изображениями смотрите Документация =&gt; Основные =&gt; Работа с
                изображениями.
            </p>
            <p>
                <strong>Приоритет - </strong> будет отображаться в порядке возрастания по приоритету.
            </p>
        </div>
    );
};

export default ArticleContent;