import React from 'react';

import styles from './content.module.css';

const BookingContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Предисловие:</h2>
            <p>
                Страницы (&quot;Все брони&quot;, &quot;Ожидающие
                брони&quot;, &quot;Заселение&quot;, &quot;Выселение&quot;) могут загружаться не много дольше ,
                в особенности страница &quot;Все брони&quot;, так как загружает большой обьем данных. Далее когда
                выбудете будете
                использовать поисковый фильтр он будет отрабатывать моментально и почти мгновенно показывать результат.
            </p>
            <p>
                !!! Исключение - только поле &quot;Дата&quot; на страницах &quot;Заселение&quot;, &quot;Выселение&quot;,
                при каждом изменении даты в
                этом поле на этих страницах, улетает запрос на сервер и собирает ответ. (По этому в зависимости от кол.
                данных на выбранный день и скорости интернета, этот фильтр может отрабатывать с задержкой).
            </p>
            <h2>Подробнее о фильтре:</h2>
            <p>
                <strong>Номер брони - </strong> ищет конкретную бронь по ее номеру. Имеет строгий режим, то есть это
                поле ищет точное совпадение по номеру.
            </p>
            <p>
                <strong>ФИО гостя - </strong> среди всех бронией совпадения слова которое вы вводите. Имеет гибкий
                режим, то есть это поле ищет все совпадения введенных букв в Фамилии Имени Очестве гостя и выдает
                результат в виде списка у кого найдены совподения.
            </p>
            <p>
                <strong>Дата - </strong> на страницах &quot;Все брони&quot;, &quot;Ожидающие брони&quot;, &quot;Заселение&quot; это поле для даты
                заселения гостя, на странице &quot;Выселение&quot; указывается дата выселения. Как писал выше на страницах
                &quot;Заселение&quot;, &quot;Выселение&quot; отрабатывает чуть с задержкой.
            </p>
            <p>
                <strong>Отель - </strong> Фильтрует все брони по выбранному отелю. Так же при выборе отеля подставляются
                номера этого отеля в поле &quot;Номер&quot;.
            </p>
            <p>
                <strong>Номер - </strong> Фильтрует все брони по выбранному номеру.
            </p>
            <p>
                <strong>Сбросить фильтры - </strong> Отчищает все поля фильтрации и отображает изначальный ответ.
            </p>
            <p>
                Все фильры связанны между собой и чтобы искать среди всех броней по одному фильтру нужно изначально
                сбросить фильтрацию остальных полей.
            </p>

            <h2>Подробнее о таблице броней:</h2>
            <p>
                <strong>Значек карандаша - </strong> нужен для перехода на страницу выбранной брони с возможностью
                редактирования ее. Так же
                может быт на фоне цветного круга, где красный круг показывает гости закончили свое проживание и нужно
                завершить бронирование, зеленый указывает на то что сейча люди проживают в номере.
            </p>
            <p>
                <strong>№ - </strong> указывает на номер брони, он является уникальным и не может повторяться.
            </p>
            <p>
                <strong>ФИО - </strong> отображает ФИО гостя, обязательно состоящее из 3х слов.
            </p>
            <p>
                <strong>Телефон - </strong> отображает номер гостя и можно нажать для вызова.
            </p>
            <p>
                <strong>Отель и Номер - </strong> отображают данные выбранного номера и отеля.
            </p>
            <p>
                <strong>Период - </strong> краткая форма даты заселения - даты выселения.
            </p>
        </div>
    );
};

export default BookingContent;