import React from 'react';

import styles from './content.module.css';

const ClientsContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Основное:</h2>
            <p>
                Этот раздел нужен для отображении таблицы гостей которые у вас производили бронирование, так же показано
                кол. заявок на бронь от гостя. Есть возможность поиска по ФИО, поиск гибкий и отображает все совпадения
                с введенной фразой.
            </p>
            <p>
                Если нажать кнопку, вы скачаете exel таблицу со всеми гостями себе на устройство.
            </p>
            <p>
                Для дополнительной защиты этот раздел находиться под отдельным паролем.
            </p>
        </div>
    );
};

export default ClientsContent;