import React from 'react';

import styles from './content.module.css';

const ConstructorContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Пошаговая инструкция:</h2>
            <p>
                1. Изначально перейдите по ссылке <a href={'https://yandex.ru/map-constructor'}
                                                     target={'_blank'}
                                                     rel="noopener noreferrer">
                открыть конструктор
            </a>
            </p>
            <p>
                2. Если у вас нет личного кабинета, авторизируйтесь.
            </p>
            <p>
                3. Вверхнем правом углу возли иконки пользователя нажмите &quot;Список карт&quot;.
            </p>
            <p>
                4. В появившемя окне нажмите &quot;Создать карту&quot;, если делаете это первый раз, или выбирите из списка нужную
                карту.
            </p>
            <p>
                5. Установите метки всех отелей с коротким описанием. То есть у вас должно быть минимум 4метки с
                адресами и описаниями (каждого отеля).
            </p>
            <p>
                6. После нажмите внизу кнопку &quot;Сохранить и продолжить&quot;
            </p>
            <p>
                7. В этом окне слева выбирите размер 1280*720px, и разместите экран карты над тем отелем которого карту
                вы делаете. Эта карта будет размещена у вас на сайте отеля на главной странице внизу.
            </p>
            <p>
                8. Нажмите кнопку &quot;Получить код карты&quot; и выбирете в всплывашке &quot;iframe&quot;.
            </p>
            <p>
                9. В этой всплывашке в текстовом окне появиться не большой код, от туда вам нужен только фрагмент,
                который находиться в кавычках переменной src. Этот фрагмент начинается на https.. и заканчивается обычно
                ..constructor
            </p>
            <p>
                10. Скопируйте этот фрагмент и вставте в поле &quot;Конструктор ссылка&quot;.
            </p>
        </div>
    );
};

export default ConstructorContent;