import React from 'react';

import styles from './content.module.css';

const FaqContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Основное для создания/редактирования:</h2>
            <p>
                Большая просьба не удалять все faq у отеля, оставляйте как минимум 1, для более корректного отображения.
                Удалять можно если вы написали слишком много, лучше просто менять данные faq, чем удалять.
            </p>
            <p>
                <strong>Вопрос - </strong> можно изменить, отображает сам вопрос в не большом блоке, по этому не стоит
                писать слишком длинный текст, короткий вопрос будет смотреться читабельно и приятно.
            </p>
            <p>
                <strong>Ответ - </strong> можно изменить, отображается только при раскрытии, по этому у него нет
                ограничения по длине, главное условие что ответ должен быть в виде одного абзаца.
            </p>
            <p>
                <strong>Приоритет - </strong> можно изменить, указывается от 1 до ... , сделано для отображения в
                порядке возрастанию по приоритету, то есть если вы хотите разместить какойто faq первее укажите ему
                более высокий приоритет. Нельзя устанавливать отрицательные приоритеты и ставить 0.
            </p>
        </div>
    );
};

export default FaqContent;