import React from 'react';

import styles from './content.module.css';

const HotelDataContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Данные отеля:</h2>
            <p>
                <strong>Название - </strong> нельзя изменить, отображает текущее название отеля и как оно отображается
                на сайтах.
            </p>
            <p>
                <strong>Мин. кол. дней - </strong> можно изменить, отображает и испоьзуется для проверки бронирования на
                минимальное колличество дней.
            </p>
            <p>
                <strong>Описание отеля - </strong> можно изменить, отображается в описании отеля на сайтах, также на
                страницах (главной, отели, бронирование в конце) и используется в сео. Описание должно состоять из
                одного абзаца и не иметь очень длинного текста, чтобы корректно отображалось на страницах.
            </p>
            <p>
                <strong>Описание территории - </strong> можно изменить, отображается на главной странице конкретного
                отеля. Описание должно состоять из одного абзаца и не иметь очень длинного текста, чтобы корректно
                отображалось на страницах.
            </p>
            <p>
                <strong>Адрес - </strong> можно изменить, отображает адрес отеля в футоре, странице контактов и других
                местах. Он не несет функциональную часть. Вы можете его указывать по свойму он служит, для
                ориентирования гостей где вы находитесь. Чаще всего нажима на этот адрес люди переходят по ссылки из
                поля &quot;Ссылка на яндекс&quot;.
            </p>
            <p>
                <strong>Адрес сайта - </strong> нельзя изменить, нужно для технических моментов.
            </p>
            <p>
                <strong>Ссылка на яндекс - </strong> можно изменить, тут требуется полная ссылка на отель из яндекса.
                Она нужна для перехода при клике на адрес.
            </p>
            <p>
                <strong>Конструктор ссылка - </strong> можно изменить, подробная инструкция находиться в Документация
                =&gt; Основные =&gt; Конструктор карт
            </p>
            <p>
                <strong>Заключение - </strong> можно изменить, отображается на странице контактов в конце конкретного
                отеля. Заключение должно состоять из одного абзаца и не иметь очень длинного текста, чтобы корректно
                отображалось на страницах.
            </p>
            <p>
                <strong>Широта и Долгота - </strong> можно изменить, нужно исключительно для СЕО, указывать нужно точное
                расположение.
            </p>

            <h2>Контакты отеля:</h2>
            <p>
                <strong>Телефон - </strong> можно изменить, указывать нужно телефон на котором есть вотсап в формате
                (79991119911) без пробелов, символов и т.д. Этот номер размещается на конкретном отеле у попадает во все
                места где указан телефон и вотсап.
            </p>
            <p>
                <strong>Телеграмм - </strong> можно изменить, указать ник из телеграмма без символа собаки.
            </p>
            <p>
                <strong>Почта - </strong> можно изменить, действующая почта.
            </p>
            <p>
                На каждом отеле можно указать разные контактные данные, сделанно для подстраховки на будущее, если это
                потребуется.
            </p>
        </div>
    );
};

export default HotelDataContent;