import React from 'react';

import styles from './content.module.css';

const ImageContent = () => {
    return (
        <div className={styles.wrapperContent}>
            <h2>Полезные ссылки:</h2>
            <p>
                Конвертер PNG/JPG в WEBP{'  '}
                <a href={'https://bigconvert.11zon.com/ru/png-to-webp'} target={'_blank'}
                   rel="noopener noreferrer">ссылка </a>
            </p>
            <p>
                Конвертер HEIC в JPG{'  '}
                <a href={'https://www.iloveimg.com/ru/convert-to-jpg/heic-to-jpg'} target={'_blank'}
                   rel="noopener noreferrer">ссылка </a>
            </p>
            <p>
                Сжатие размера изображения {'  '}
                <a href={'https://tinypng.com/'} target={'_blank'}
                   rel="noopener noreferrer">ссылка </a>
            </p>
            <p>
                Сжатие размера изображения {'  '}
                <a href={'https://www.iloveimg.com/ru/compress-image'} target={'_blank'}
                   rel="noopener noreferrer">ссылка </a>
            </p>

            <h2>Пошаговая инструкция:</h2>

            <p>
                1. Если не дай бог у вас фотография из айфона (что не желательно), воспользуйтесь ссылкой выше
                конвекртируйте ее в JPG, после конвектируйте в формат WEBP.
            </p>
            <p>
                2. После воспользуйтесь ссылками и ужмите конвек. фотографию несколько раз. Хорошее ужатие будет если
                фотография будет весить 150-300кб, иногда можно больше, главное не желательно больше 1МБ потому что, чем
                больше размер фото тем больше оно будет грузиться у клиента (особенно с плохим интернетом). P.S: иногда
                я вначале ужимаю JPG потом перевожу в WEBP и еще пару раз ужимаю (просто смотрю чтобы максимально ужать
                изображение и проверяю качество чтобы не сильно страдало).
            </p>
            <p>
                3. После меняем название фотографии, желательно осмысленное название (например если это 2я фотография
                номера 4, то можно назвать apartment4_2). !!! НО самое главное в название нельзя использовать рус.
                буквы, пробелы в названии, спец символы кроме нижнего дефиса _ и самое главное расширение должно быть
                WEBP.
            </p>
            <p>
                Просьба называть фото осмысленно, кроется в том, что если вдруг мне придется искать какие либо
                изображения на сервере при ошибке или не правильном нейминге осмысленное название найти проще. =)
            </p>

            <p>
                Почему важно в название нельзя использовать рус. буквы, пробелы в названии, спец символы кроме нижнего
                дефиса _ Это потому что название может сохраниться, но может произойти преобразование на сервере или в
                браузере при отображении и будет не известная ошбка и не явное поведение.
            </p>
            <p>
                Почему важно расширение должно быть WEBP, оно лучше работает с браузерами и позваоляет быстрее
                загружаться. При этом когда вы переводете например PNG в WEBP размер может уменьшиться в десятки и более
                раз (Например с 2МБ стать 400КБ).
            </p>
        </div>
    );
};

export default ImageContent;