'use client'

import React, {useState} from 'react';
import ReactMarkdown from 'react-markdown';

import {useRedirectAdmin} from "../../../../hooks/useRedirectAdmin";
import TitleAdmin from "../../../../components/ui/admin/titleAdmin/titleAdmin";

import styles from '../../../../styles/pageAdmin/doc/markdownPage.module.css';
import stylesFont from '../../../../styles/fonts/timesNewRoman.module.css';

const MarkdownPage = () => {
    useRedirectAdmin();

    const [value, setValue] = useState('');

    return (
        <div className={styles.mainWrapper}>
            <TitleAdmin text={'Шаблонизатор Markdown'}/>
            <div>
                <p>Выбрать шаблон:</p>
            </div>

            <textarea className={styles.textarea} value={value} onChange={(e) => setValue(e.target.value)}/>
            <TitleAdmin text={'Пример отображения текста:'}/>
            <div className={`${stylesFont.newRoman400} ${styles.markdown}`}>
                <ReactMarkdown>
                    {value}
                </ReactMarkdown>
            </div>

            <TitleAdmin text={'Инструкция:'}/>
            <ExempleArticle/>
        </div>
    );
};

export default MarkdownPage;


const ExempleArticle = () => {
    return (
        <div>
            <p>
                # - этот знак нужен для обозначения подзаголовка в статье можно использовать от 2х до 6 таких знаков
                (влияет на размер подзаголовка, у всех подзаголовков установлены отступы сверху и с низу).
                <span> !!! Нельзя использовать 1 этот знак, будет ошибкой в СЕО !!! </span>
            </p>
            <br/>
            <p>
                \ - этот знак нужен для разделение абзацев (нужно ставить 2 знака на отдельных строчках как
                в примере, чтобы следующий текст начать писать в новом абзаце).
                <span>  !!! Использовать перед знаком # нельзя, так как он будет отображаться перед подзаголовком в тексте,
                    у подзаголовков уже установлены отступы !!! </span> ИЛИ
            </p>
            <p>
                Нужно вставить пустую строчку
                между текстами с помощью Enter на клавиатуре, нажимаете дважды появлятсе в поле пустая строчка, а в
                статье это отобразиться как начало нового абзаца с красной строчки, без лишней пустой строчки.
            </p>
            <br/>
            <p>
                * - этот знак, Если вы обернете слово, словосочетание, текст с двух сторон : <br/>
                1. одним знаком - то вы получите курсивное начертание, как в примере <br/>
                2. двумя знаками - то вы получите жирное начертание, как в примере <br/>
                1. тремя знаками - то вы получите курсивно-жирное начертание, как в примере <br/>
            </p>
            <br/>
            <p>
                Работа со списками: <br/>
                Если на каждой новой строчки ставить число с точкой (как в примере), вы получаете нумерной список <br/>
                Если на каждой новой строчки ставить знак * (как в примере), вы получаете список с маркерами<br/>
                {/*{`Если под каким-либо номером списка поставить знак в начале строчки > и пробел вы получаете, описание*/}
                {/*    конкретного элемента списка (как указано в примере).`}*/}
            </p>
            <br/>
            <p>
                *** - этот знак нужен для вставки полоски имеющий отступы с верху и с низу как в примере.
                <span> Нужно вставлять на новой строчке как указано в примере </span>
            </p>
            <br/>
            <p>
                Перед сохранением/копированием проверьте как отображается ваш написанный текст !
            </p>
        </div>
    );
};

const test = `
                В 2023 году *Новороссийский филиал* ФГБУ «Центр оценки качества зерна» провел исследование почти 2 млн тонн кукурузы, отправленной на экспорт в 15 стран для продовольственных нужд. Экспорт кукурузы удивительным образом удвоился по сравнению с предыдущим годом, составив около 900 тыс. тонн под контролем филиала.

Крупнейшими импортерами стали **Турция, Ливия, Вьетнам, Южная Корея и Ливан**, причем 76% кукурузы пошло в Турцию. Из Краснодарского края также были экспортированы значительные объемы кукурузных отрубей, кукурузной барды и кукурузной крупы в различные страны, такие как Канада, Израиль, Грузия и Армения.

Перед этим текстом просто стоит пустая строчка и он начинается с новой строчки.

### Какой либо под заголовок


Сотрудники филиала осуществляют тщательные ***фитосанитарные проверки*** каждой партии кукурузы. Это включает в себя энтомологические, гербологические и фитопатологические исследования, а также тесты на безопасность и качество, соответствуя требованиям стран-импортеров.

***

1. Первый пункт списка номерного
2. Второй пункт списка номерного
3. Третий пункт списка номерного

* Первый пункт списка
* Второй пункт списка
* Третий пункт списка

***
`