import {HOTEL_LINK, DEFAULT_CONTACTS} from "../config/envData";
import {getFullPathImage} from "../utils/getFullPathImage";

const createMetaData = ({
                            title,
                            description,
                            keywords,
                            openGraphUrl,
                            openGraphImageUrl,
                            openGraphType,
                        }) => {
    return {
        title,
        description,
        keywords,
        openGraph: {
            title,
            description,
            url: openGraphUrl,
            images: [
                {
                    url: openGraphImageUrl,
                    width: 1200,
                    height: 630,
                    alt: 'Базы отдыха на черном море',
                },
                {
                    url: `${HOTEL_LINK}/previe/previe_Hotel_4.webp`,
                    width: 1200,
                    height: 630,
                    alt: 'Базы отдыха на черном море',
                },
            ],
            type: openGraphType,
        },
        robots: META_ROBOTS
    }
}

const keywordsHotel = {
    "hotel_1": [
        "База отдыха Шикарный вид",
        "Котедж в Шикарный вид",
        "описание котеджа в Шикарный вид",
        "удобства котеджа в Шикарный вид",
        "цены котеджа в Вижу море",
        "онлайн бронирование котеджа в Шикарный вид",
        "Котедж у моря Кабардинка",
        "Котедж на черном море",
        "снять котедж в Кабардинке",
        "снять номер в Кабардинке",
        "аренда котеджа в Кабардинке",
        "аренда номера в Кабардинке",
        "котедж с видом на море Кабардинка",
        "посуточная аренда котеджа на черном море",
        "котедж на берегу моря",
        "котедж в бетте +у моря",
    ],
    "hotel_2": [
        "База отдыха Бор о дача",
        "Котедж в Бор о дача",
        "Номер в Бор о дача",
        "описание котеджа в Бор о дача",
        "удобства котеджа в Бор о дача",
        "цены котеджа в Бор о дача",
        "цены номеров в Бор о дача",
        "онлайн бронирование котеджа в Бор о дача",
        "онлайн бронирование номера в Бор о дача",
        "Котедж у моря х.Бетта",
        "Котедж в лесу",
        "снять котедж в хуторе бетта",
        "аренда котеджа в бетте",
        "котедж в лесу бетта",
        "посуточная аренда котеджа на черном море",
        "котедж в бетте +у моря",
    ],
    "hotel_3": [
        "База отдыха Вижу море",
        "Котедж в Вижу море",
        "описание котеджа в Вижу море",
        "удобства котеджа в Вижу море",
        "цены котеджа в Вижу море",
        "онлайн бронирование котеджа в Вижу море",
        "Котедж у моря х.Бетта",
        "Котедж на черном море",
        "снять котедж в хуторе бетта",
        "аренда котеджа в бетте",
        "котедж с видом на море бетта",
        "посуточная аренда котеджа на черном море",
        "котедж на берегу моря",
        "котедж в бетте +у моря",
    ],
    "hotel_4": [
        "Апартаменты в Сан Марина",
        "описание апартаментов в Сан Марина",
        "удобства в апартаментах в Сан Марина",
        "цены апартаментов в Сан Марина",
        "онлайн бронирование апартаментов в Сан Марина",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "снять апартаменты в сочи",
        "аренда квартиры в сочи",
        "снять апартаменты в Лазаревском",
        "аренда квартиры в Лазаревском",
        "апартаменты на берегу моря",
        "апартаменты в сочи +у моря",
    ],
};

const META_ROBOTS = {
    index: true, // Индексировать страницу
    follow: true, // Следовать по ссылкам на странице
    googleBot: {
        index: true, // Индексировать содержимое страницы GoogleBot
        follow: true, // Не следовать по ссылкам GoogleBot
    },
    yandexBot: {
        index: true, // Индексировать содержимое страницы YandexBot
        follow: true, // Следовать по ссылкам YandexBot
    }
};

/** Главная страница */
export const metaDataMainPage = createMetaData({
    title: 'Базы отдыха на берегу черного моря - Край Моря',
    description: `Базы отдыха на берегу Черного моря. Единый номер телефона для бронирования ${DEFAULT_CONTACTS.phoneRU}.`,
    keywords: [
        'Базы отдыха на черном море',
        'Апартаменты на черном море',
        'Номера на черном море',
        'Коттедж на черном море ',
        'Снять дом на черном море',
        'Описание баз отдыха на черном море',
        'Базы отдыха в краснодарском крае',
        'Апартаменты в краснодарском крае',
        'Номера в краснодарском крае',
        'Коттедж в краснодарском крае ',
        'Снять дом в краснодарском крае',
        'Описание баз отдыха в краснодарском крае',
    ],
    openGraphUrl: HOTEL_LINK,
    openGraphImageUrl: `${HOTEL_LINK}/previe/previe_Hotel_4.webp`,
    openGraphType: 'website'
});

/** Страница отелей */
export const mataDataHotelsPage = createMetaData({
    title: `Список отелей на черном море - Край Моря`,
    description: `Выбирайте любой наш отель на Черном море в Кабардинке, Геленджике, Сочи. Забронируйте прямо сейчас! Телефон: ${DEFAULT_CONTACTS.phoneRU}.`,
    keywords: [
        "Сан Марина",
        "Отель Сан Марина",
        "апартаменты Сан Марина",
        "отели в сочи",
        "отели в Лазаревском",
        "Вижу Море",
        "Отель Вижу Море",
        "База отдыха Вижу Море",
        "Бор О Дача",
        "Отель Бор О Дача",
        "База отдыха Бор О Дача",
        "отели в Бетте",
        "отели в Геленджике",
        "база отдыха в Бетте",
        "база отдыха в Геленджике",
        "Шикарный вид",
        "Отель Шикарный вид",
        "апартаменты Шикарный вид",
        "отели в Кабардинке",
        "база отдыха в Кабардинке",
        "отели на черном море",
        "база отдыха на черном море",
    ],
    openGraphUrl: `${HOTEL_LINK}/hotels`,
    openGraphImageUrl: `${HOTEL_LINK}/bannerHotels.webp`,
    openGraphType: 'website'
});

/** Страница номеров со всех наших отелей */
export const metaDataReservationAllPage = createMetaData({
    title: "Выбор жилья на Черном море",
    description:
        "Выбирайте и бронируйте апартаменты, номера, котеджи на Черном море в Сочи, Лазаревском, Кабардинке, Бетте, Геленджике.",
    keywords: [
        "Апартаменты Сан Марина",
        "ЖК Сан Марина",
        "Апартаменты и коттеджи Вижу море",
        "Апартаменты и коттеджи Бор о дача",
        "Апартаменты и коттеджи Шикарный вид",
        "Номера Вижу море",
        "Номера Бор о дача",
        "Номера Шикарный вид",
        "ареда котеджа на черном море",
        "снять жилье на черном море",
        "Апартаменты у моря",
        "Апартаменты на черном море",
        "снять апартаменты на черном море",
        "аренда квартиры на черном море",
    ], // Ключевые слова, связанные с вашим отелем и местоположением
    openGraphUrl: `${HOTEL_LINK}/reservation`,
    openGraphImageUrl: `${HOTEL_LINK}/bannerHotels.webp`,
    openGraphType: 'website'
});

/** Страница конкретного номера */
export const metaDataCurrentRoom = (id, currentHotel, currentApartment) => {
    return createMetaData({
        title: `${currentApartment?.apartment_name || "Прекрасные апартаменты на черном море"}`,
        description: `${currentApartment?.apartment_description || "Прекрасное метсо для вашего отдыха на черноморском побережье"}`,
        keywords: currentHotel?.type && keywordsHotel[currentHotel.type],
        openGraphUrl: `${HOTEL_LINK}/reservation/${id}`,
        openGraphImageUrl: getFullPathImage(currentApartment.apartment_preview_img_name, currentApartment.apartment_preview_img_name),
        openGraphType: 'website'
    });
};

/** Страница блога (список статей) */
export const metaDataBlogPage = createMetaData({
    title: `Блог - интересные места и достопримечательности на Черном море`,
    description: `Ознакомьтесь с нашим блогом: лучшие маршруты, достопримечательности, пляжи, заведения и природные заповедники.`,
    keywords: [
        "Блог Край Моря",
        "Список статей о Черном море",
        "Интересные места Краснодарского края",
        "Достопримечательности Черного моря",
        "Что посмотреть на Черном море",
        "Маршруты для прогулок",
        "Лучшие пляжи Краснодарского края",
        "Исторические места Краснодарского края",
        "Природные заповедники Краснодарского края",
        "Гид по Черному морю",
        "Путеводитель по Черному морю",
        "Идеи для отдыха на Черном море"
    ],
    openGraphUrl: `${HOTEL_LINK}/blog`,
    openGraphImageUrl: `${HOTEL_LINK}/bannerHotels.webp`,
    openGraphType: 'website'
});

/** Страница конкретной статьи */
export const metaDataCurrentArticle = ({id, title, description, urlPreview}) => {
    return createMetaData({
        title,
        description,
        keywords: [
            'Статья',
            title
        ],
        openGraphUrl: `${HOTEL_LINK}/blog/${id}`,
        openGraphImageUrl: urlPreview,
        openGraphType: 'article'
    });
}

/** Страница контактов */
export const metaDataContactsPage = createMetaData({
    title: `Контактная информация и адрес`,
    description: `Контакты всех наших Баз отдыха. Общие контакты ${DEFAULT_CONTACTS.phoneRU} для бронирования и обслуживания гостей.`,
    keywords: [
        'Контакты баз отдыха на черном море',
        'Адреса баз отдыха на черном море',
        'Телефон для бронирования в Шикарный вид',
        'Телефон для бронирования в Бор о дача',
        'Телефон для бронирования в Вижу море',
        'Телефон для бронирования в Сан Марина',
        'Адрес базы отдыха Шикарный вид',
        'Адрес базы отдыха Бор о дача',
        'Адрес базы отдыха Вижу море',
        'Адрес базы отдыха Сан Марина',
        'Заявка на обратный звонок с базы отдыха'
    ],
    openGraphUrl: `${HOTEL_LINK}/contacts`,
    openGraphImageUrl: `${HOTEL_LINK}/banner.webp`,
    openGraphType: 'website'
});

/** Страница FAQ */
export const metaDataQuestionPage = createMetaData({
    title: `Часто задаваемые вопросы`,
    description: `Часто задаваемые вопросы о наших Базах Отдыха. Тут вы узнаете ответы на все часто заадаваемые вопросы.`,
    keywords: [
        "Край Моря",
        "FAQ Край Моря",
        "вопрос-ответ",
        "Правила проживания на Базах Отдыха",
        "Часто задоваемые вопросы",
        "Апартаменты на черном море",
        "информация о наших Базах Отдыха",
        "пляж возле Баз Отдыха",
        "правила проживания в базе отдыха",
    ],
    openGraphUrl: `${HOTEL_LINK}/questionlist`,
    openGraphImageUrl: `${HOTEL_LINK}/banner.webp`,
    openGraphType: 'website'
});


