import {HOTEL_LINK, DEFAULT_CONTACTS} from "../config/envData";

const keywordsHotel = {
    "hotel_1": [
        "База отдыха Шикарный вид",
        "Котедж в Шикарный вид",
        "описание котеджа в Шикарный вид",
        "удобства котеджа в Шикарный вид",
        "цены котеджа в Вижу море",
        "онлайн бронирование котеджа в Шикарный вид",
        "Котедж у моря Кабардинка",
        "Котедж на черном море",
        "снять котедж в Кабардинке",
        "снять номер в Кабардинке",
        "аренда котеджа в Кабардинке",
        "аренда номера в Кабардинке",
        "котедж с видом на море Кабардинка",
        "посуточная аренда котеджа на черном море",
        "котедж на берегу моря",
        "котедж в бетте +у моря",
    ],
    "hotel_2": [
        "База отдыха Бор о дача",
        "Котедж в Бор о дача",
        "Номер в Бор о дача",
        "описание котеджа в Бор о дача",
        "удобства котеджа в Бор о дача",
        "цены котеджа в Бор о дача",
        "цены номеров в Бор о дача",
        "онлайн бронирование котеджа в Бор о дача",
        "онлайн бронирование номера в Бор о дача",
        "Котедж у моря х.Бетта",
        "Котедж в лесу",
        "снять котедж в хуторе бетта",
        "аренда котеджа в бетте",
        "котедж в лесу бетта",
        "посуточная аренда котеджа на черном море",
        "котедж в бетте +у моря",
    ],
    "hotel_3": [
        "База отдыха Вижу море",
        "Котедж в Вижу море",
        "описание котеджа в Вижу море",
        "удобства котеджа в Вижу море",
        "цены котеджа в Вижу море",
        "онлайн бронирование котеджа в Вижу море",
        "Котедж у моря х.Бетта",
        "Котедж на черном море",
        "снять котедж в хуторе бетта",
        "аренда котеджа в бетте",
        "котедж с видом на море бетта",
        "посуточная аренда котеджа на черном море",
        "котедж на берегу моря",
        "котедж в бетте +у моря",
    ],
    "hotel_4": [
        "Апартаменты в Сан Марина",
        "описание апартаментов в Сан Марина",
        "удобства в апартаментах в Сан Марина",
        "цены апартаментов в Сан Марина",
        "онлайн бронирование апартаментов в Сан Марина",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "снять апартаменты в сочи",
        "аренда квартиры в сочи",
        "снять апартаменты в Лазаревском",
        "аренда квартиры в Лазаревском",
        "апартаменты на берегу моря",
        "апартаменты в сочи +у моря",
    ],
};

const META_GENERAL_DATA = {
    image: {
        url: `${HOTEL_LINK}/previe/previe_Hotel_4.webp`, // Абсолютный URL изображения
        width: 1200,
        height: 630,
        alt: 'Отель Сан Марина в Лазаревском с видом на Черное море', // Альтернативный текст для изображения
    },
    robots: {
        index: true, // Индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
}

// главная страница
export const metaDataMainPage = {
    title: "Апартаменты на берегу моря - Сан Марина",
    description: `Апартаменты Сан Марина в Лазаревском на берегу Черного моря. 
                  Бронирование по адресу ${DEFAULT_CONTACTS.address} или телефону ${DEFAULT_CONTACTS.phoneRU}.`,
    keywords: [
        "Отель Сан Марина",
        "Сан Марина",
        "Лазаревское",
        "Сочи",
        "Краснодарский край",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "пляж Сан Марина",
        "апартаменты Сан Марина",
        "жилье на море",
        "семейный отдых в Лазаревском",
        "снять апартаменты в сочи",
        "снять апартаменты в Лазаревском",
        "апартаменты на берегу моря",
        "южное побережье России",
    ], // Ключевые слова, связанные с вашим отелем и местоположением
    openGraph: {
        site_name: "Сан Марина - Апартаменты в Лазаревском",
        determiner: "the", // Опционально
        title: "Апартаменты на берегу моря - Сан Марина",
        description:
            `Апартаменты Сан Марина в Сочи, предназначен для шикарного отдыха и приятных воспоминаний.
     ${DEFAULT_CONTACTS.address}, ${DEFAULT_CONTACTS.phoneRU} для бронирования и обслуживания гостей.`,
        url: HOTEL_LINK, // Абсолютный URL вашей страницы
        images: [
            //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU", // Языковая локаль (русский, Россия)
        type: "website", // Тип страницы (веб-сайт)
    },
    robots: META_GENERAL_DATA.robots
};

// страница отелей
export const mataDataHotelsPage = {
    title: "Список отелей на черном море - Сан Марина",
    description:
        `Выбирайте любой наш отель на Черном море в Кабардинке, Геленджике, Сочи. Забронируйте прямо сейчас! Телефон: ${DEFAULT_CONTACTS.phoneRU}.`,
    keywords: [
        "Сан Марина",
        "Отель Сан Марина",
        "апартаменты Сан Марина",
        "отели в сочи",
        "отели в Лазаревском",
        "Вижу Море",
        "Отель Вижу Море",
        "База отдыха Вижу Море",
        "Бор О Дача",
        "Отель Бор О Дача",
        "База отдыха Бор О Дача",
        "отели в Бетте",
        "отели в Геленджике",
        "база отдыха в Бетте",
        "база отдыха в Геленджике",
        "Шикарный вид",
        "Отель Шикарный вид",
        "апартаменты Шикарный вид",
        "отели в Кабардинке",
        "база отдыха в Кабардинке",
        "отели на черном море",
        "база отдыха на черном море",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        site_name: "Сан Марина - Апартаменты в Лазаревском",
        determiner: "the",
        title: "Список отелей на черном море",
        description:
            `Выбирайте любой наш отель на Черном море в Кабардинке, Геленджике, Сочи. Забронируйте прямо сейчас! Телефон: ${DEFAULT_CONTACTS.phoneRU}.`,
        url: `${HOTEL_LINK}/hotels`, // Абсолютный URL вашей страницы
        images: [
            //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU", // Языковая локаль (русский, Россия)
        type: "website", // Тип страницы (веб-сайт)
    },
    robots: META_GENERAL_DATA.robots
};

// страница номеров текущего отеля
export const metaDataReservationPage = {
    title: "Список апартаментов в Сан Марина",
    description:
        "Выбирайте и бронируйте апартаменты в Сочи, Лазаревское. Сравните цены, количество комнат и вместимость для идеального отдыха у моря.",
    keywords: [
        "Отель Сан Марина",
        "ЖК Сан Марина",
        "Апартаменты Сан Марина",
        "Сан Марина",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "снять апартаменты в сочи",
        "аренда квартиры в сочи",
        "снять апартаменты в Лазаревском",
        "аренда квартиры в Лазаревском",
        "апартаменты на берегу моря",
        "номера в сочи +у моря",
        "Сочи отели",
        "жилье в сочи",
        "Лазаревское отели",
        "жилье в лазаревском",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        site_name: "Сан Марина - выбор апартаментов",
        determiner: "the", // Опционально
        title: "Список апартаментов в Сан Марина",
        description:
            "Выбирайте и бронируйте апартаменты в Сочи, Лазаревское. Сравните цены, количество комнат и вместимость для идеального отдыха у моря.",
        url: `${HOTEL_LINK}/reservation`, // Абсолютный URL вашей страницы
        images: [
            //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU", // Языковая локаль (русский, Россия)
        type: "website", // Тип страницы (веб-сайт)
    },
    robots: META_GENERAL_DATA.robots
};

// страница номеров со всех наших отелей
export const metaDataReservationAllPage = {
    title: "Выбор жилья на Черном море",
    description:
        "Выбирайте и бронируйте апартаменты, номера, котеджи на Черном море в Сочи, Лазаревском, Кабардинке, Бетте, Геленджике.",
    keywords: [
        "Отель Сан Марина",
        "ЖК Сан Марина",
        "База отдыха Вижу море",
        "База отдыха Бор о дача",
        "База отдыха Шикарный вид",
        "Номера Вижу море",
        "Номера Бор о дача",
        "Номера Шикарный вид",
        "ареда котеджа на черном море",
        "снять жилье на черном море",
        "Апартаменты Сан Марина",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "снять апартаменты в сочи",
        "аренда квартиры в сочи",
        "снять апартаменты в Лазаревском",
        "аренда квартиры в Лазаревском",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        site_name: "Выбор жилья на Черном море",
        determiner: "the", // Опционально
        title: "Выбор жилья на Черном море",
        description:
            "Выбирайте и бронируйте апартаменты, номера, котеджи на Черном море в Сочи, Лазаревском, Кабардинке, Бетте, Геленджике.",
        url: `${HOTEL_LINK}/reservationall`, // Абсолютный URL вашей страницы
        images: [
            //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU", // Языковая локаль (русский, Россия)
        type: "website", // Тип страницы (веб-сайт)
    },
    robots: META_GENERAL_DATA.robots
};

// страница конкретного номера
export const metaDataCurrentRoom = (id, currentHotel, currentApartment) => {
    return {
        title: `${currentApartment?.apartment_name || "Прекрасные апартаменты на черном море"} 
        || ${currentHotel?.name || "Отель на Черном море"}`,
        description: `${currentApartment?.apartment_description || "Прекрасное метсо для вашего отдыха на черноморском побережье"}`,
        keywords: currentHotel?.type && keywordsHotel[currentHotel.type], // Ключевые слова, связанные с вашим отелем и местоположением
        openGraph: {
            site_name: "Сан Марина - Апартаменты в Лазаревском",
            determiner: "the", // Опционально
            title: `${currentApartment?.apartment_name || "Прекрасные апартаменты на черном море"} 
            || ${currentHotel?.name || "Отель на Черном море"}`,
            description: `${currentApartment?.apartment_description || "Прекрасное метсо для вашего отдыха на черноморском побережье"}`,
            url: `${HOTEL_LINK}/reservation/${id}`, // Абсолютный URL вашей страницы
            images: [
                //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
                META_GENERAL_DATA.image
            ],
            locale: "ru_RU", // Языковая локаль (русский, Россия)
            type: "website", // Тип страницы (веб-сайт)
        },
        robots: META_GENERAL_DATA.robots
    };
};

// Страница блога (список статей)
export const metaDataBlogPage = {
    title: "Блог - интересные места и достопримечательности на Черном море",
    description: `Ознакомьтесь с нашим блогом: лучшие маршруты, достопримечательности, пляжи, заведения и природные заповедники.`,
    keywords: [
        "Блог Сан Марина",
        "Список статей о Черном море",
        "Интересные места Лазаревское",
        "Достопримечательности Черного моря",
        "Что посмотреть в Сочи",
        "Маршруты для прогулок",
        "Лучшие пляжи Лазаревского",
        "Исторические места Сочи",
        "Природные заповедники Краснодарского края",
        "Гид по Черному морю",
        "Куда сходить в Лазаревском",
        "Сан Марина блог",
        "Путеводитель по Лазаревскому",
        "Идеи для отдыха на Черном море"
    ],

    openGraph: {
        site_name: "Сан Марина - Блог о Черном море",
        determiner: "the",
        title: "Блог - интересные места и достопримечательности на Черном море",
        description: `Исследуйте блог Сан Марина: список статей о лучших местах для отдыха на Черном море. Удобный путеводитель по маршрутам и достопримечательностям.`,
        url: `${HOTEL_LINK}/blog`,
        images: [
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU",
        type: "website" // Тип страницы: веб-сайт/каталог
    },
    robots: META_GENERAL_DATA.robots
};

// Страница конкретной статьи
export const metaDataCurrentArticle = ({id, title, description, keywords = [], siteName = "Сан Марина"}) => {
    return {
        title: title,
        description: description,
        keywords: keywords.length ? keywords : ["блог", "интересные места", "достопримечательности"],
        openGraph: {
            site_name: siteName,
            determiner: "the",
            title: title,
            description: description,
            url: `${HOTEL_LINK}/blog/${id}`,
            images: [
                META_GENERAL_DATA.image // Можно заменить на параметр images, если потребуется
            ],
            locale: "ru_RU",
            type: "article"
        },
        robots: META_GENERAL_DATA.robots || "index, follow" // Подстраховка, если META_GENERAL_DATA.robots будет пустым
    };
};

// страница контактов
export const metaDataContactsPage = {
    title: "Контактная информация и адрес - Сан Марина",
    description:
        `Контакты апартаментов Сан Марина в Лазаревское. ${DEFAULT_CONTACTS.address},  ${DEFAULT_CONTACTS.phoneRU} для бронирования и обслуживания гостей.`,
    keywords: [
        "Отель Сан Марина",
        "ЖК Сан Марина",
        "Сан Марина",
        "Контакты Сан Марина",
        "Адрес Сан Марина",
        "Почта Сан Марина",
        "расположение Сан Марина",
        "Апартаменты Сан Марина",
        "Лазаревское",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "пляж Сан Марина",
        "интересные места в Лазаревском",
        "куда сходить в Лазаревском",
        "номер телефона Сан Марина",
        "Краснодарский край, Сочи, Лазаревское, ул. Одоевского, 87",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        site_name: "Сан Марина - Контактная информация",
        determiner: "the", // Опционально
        title: "Контактная информация и адрес - Сан Марина",
        description:
            `Контакты апартаментов Сан Марина в Лазаревское. ${DEFAULT_CONTACTS.address},  ${DEFAULT_CONTACTS.phoneRU} для бронирования и обслуживания гостей.`,
        url: `${HOTEL_LINK}/contacts`, // Абсолютный URL вашей страницы
        images: [
            //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU", // Языковая локаль (русский, Россия)
        type: "website", // Тип страницы (веб-сайт)
    },
    robots: META_GENERAL_DATA.robots
};

// страница пути до жк Сан Марина (как добраться до отеля)
export const metaDataTrackPage = {
    title: "Как добраться до ЖК Сан Марина",
    description:
        `Путь на общественном транспорте до ЖК Сан Марина.`,
    keywords: [
        "Отель Сан Марина",
        "ЖК Сан Марина",
        "Путь до ЖК Сан Марина",
        "Как доехать до Сан Марина",
        "Адлер — Лазаревское: как добраться?",
        "Добраться из аэропорта Адлер до Лазаревского",
        "Сан Марина",
        "Контакты Сан Марина",
        "Адрес Сан Марина",
        "расположение Сан Марина",
        "Апартаменты Сан Марина",
        "Лазаревское",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "Краснодарский край, Сочи, Лазаревское, ул. Одоевского, 87",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        site_name: "Сан Марина - как доехать",
        determiner: "the", // Опционально
        title: "Путь до ЖК Сан Марина",
        description:
            `Путь на общественном транспорте до ЖК Сан Марина.`,
        url: `${HOTEL_LINK}/contacts/track/bus`, // Абсолютный URL вашей страницы
        images: [
            //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU", // Языковая локаль (русский, Россия)
        type: "website", // Тип страницы (веб-сайт)
    },
    robots: META_GENERAL_DATA.robots
};

// страница FAQ
export const metaDataQuestionPage = {
    title: "Часто задаваемые вопросы об апартаментах Сан Марина",
    description: "Часто задаваемые вопросы об апартаментах Сан Марина. Тут вы узнаете ответы на все часто заадаваемые вопросы.",
    keywords: [
        "Отель Сан Марина",
        "Сан Марина",
        "FAQ Сан Марина",
        "вопрос-ответ Сан Марина",
        "Правила проживания в Сан Марина",
        "ЖК Сан Марина",
        "Часто задоваемые вопросы - Сан Марина",
        "Апартаменты у моря Лазаревское",
        "Апартаменты на черном море",
        "информация об апартаментах в Сан Марина",
        "пляж возле Сан Марина",
        "правила проживания в Сан Марина",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        site_name: "Сан Марина - faq",
        determiner: "the", // Опционально
        title: "Часто задаваемые вопросы об апартаментах Сан Марина",
        description:
            "Часто задаваемые вопросы об апартаментах Сан Марина. Тут вы узнаете ответы на все часто заадаваемые вопросы.",
        url: `${HOTEL_LINK}/questionlist`, // Абсолютный URL вашей страницы
        images: [
            //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            META_GENERAL_DATA.image
        ],
        locale: "ru_RU", // Языковая локаль (русский, Россия)
        type: "website", // Тип страницы (веб-сайт)
    },
    robots: META_GENERAL_DATA.robots
};


